//======================================================================
//	工程名称：	IrDA.mcp
//	功能描述：	通过超级终端可以看到红外的传输状态及其结果
//  IDE环境：   ADS v1.2
//	涉及的库：	无
//	组成文件：	main.c, IrDA.c IrDA.h
//	硬件连接：	
//	维护记录：	2009-9-23	V1.0  
//======================================================================

//=============================================================
// 文件名称：	main.c
// 功能描述：	定义主函数
// 维护记录：	2009-9-23	V1.0
//=============================================================

//====================================================
// 包含头文件区
//====================================================
#include "2440lib.h"
#include "IrDA.h"
#include "uart.h"
#include "string.h"
//====================================================
// 语法格式：void Main(void)
// 功能描述: 主函数
// 入口参数: 无
// 出口参数: 无
//====================================================
void Main(void)
{
	memcpy((unsigned char *)0x0,(unsigned char *)0x30000000,0x1000);
    
	SetSysFclk(FCLK_400M);  //设置系统时钟 400M     
	ChangeClockDivider(2, 1);      //设置分频 1：4：8
	CalcBusClk();           //计算总线频
	
	Uart_Select(0);    
	Uart_Init(0, 115200);   //设置端口 波特率115200  无数据流检测   数据位= 8位
	
	Select_Device(IrDA);
	IrDA_Port_Set();
		
	Uart_Printf("\2440 IrDA RX Test start\n");
	   
    while(1)
    { 	  
	     Test_IrDA_Rx();   
    }    
 }