//======================================================================
//	工程名称：	DS18B20.mcp
//	功能描述：	驱动DS18B20,在终端上显示温度值
//  IDE环境：   ADS v1.2
//	组成文件：	main.c
//	硬件连接：	DQ ---- GPB5
//	维护记录：	2009-10-15	V1.0   by xgc 
//======================================================================

//=============================================================
// 文件名称：	main.c
// 功能描述：	定义了主函数
// 维护记录：	2009-10-15	V1.0
//=============================================================
//====================================================
// 包含头文件区
//====================================================
#include "2440addr.h"
#include "2440lib.h"
#include "option.h"
#include "def.h"
#include "uart.h"
#include "DS18B20.h"

void Main(void)
{
	SetSysFclk(FCLK_220M);  //设置系统时钟 220M     
	ChangeClockDivider(1, 1);      //设置分频 1：2：4
	CalcBusClk();           //计算总线频
	
	Uart_Select(0);
	Uart_Init(0, 115200);
	
	Test_DS18B20();
	while(1);
}