//======================================================================
//	工程名称：  ADC.mcp
//	功能描述：	采样ADC转换值，发送到串口显示
//  IDE环境：   ADS v1.2
//	涉及的库：	无
//	组成文件：	main.c	uart.c	
//	硬件连接：	ADC连接两个电位器，拧动电位器即可改变AD值
//	维护记录：	2009-08-14	v1.0     by xgc
//				2009-10-28  v1.1     by xgc
//======================================================================

//========================================================
//	函数名称：	main
//	功能描述：	通过串口，显示AD值
//	维护记录：	2009-08-14	v1.0     by xgc
//				2009-10-28  v1.1     by xgc
//========================================================

#include "2440addr.h"
#include "2440lib.h"
#include "option.h"
#include "uart.h"
#include "ADC.h"

void Main()
{ 
	SetSysFclk(FCLK_400M);  //设置系统时钟 400M     
	ChangeClockDivider(2, 1);      //设置分频 1：4：8
	CalcBusClk();           //计算总线频

	Uart_Select(0);
    Uart_Init(0, 115200);
	Uart_Printf("\n ---ADC测试程序---\n"); 
	
	while(1)
	{
		Test_ADC();
	}
 } 