//======================================================================
//	工程名称：	PWM.mcp
//	功能描述：	实现占空比为50%的PWM输出，按'+','-'键，可增加或减少频率
//  IDE环境：   ADS v1.2
//	组成文件：	main.c, PWM.c PWM.h
//	硬件连接：	无
//	维护记录：	2009-08-15	V1.0   by xgc
//              2009-10-28  V1.1   by xgc 
//======================================================================

//=============================================================
// 文件名称：	main.c
// 功能描述：	定义了主函数
// 维护记录：	2009-08-15	V1.0
//              2009-10-28  V1.1    
//=============================================================

//====================================================
// 包含头文件区
//====================================================
#include "2440addr.h"
#include "2440lib.h"
#include "option.h"
#include "def.h"
#include "uart.h"
#include "PWM.h"

//====================================================
// 语法格式：void Main(void)
// 功能描述: 主函数
// 入口参数: 无
// 出口参数: 无
//====================================================

void Main(void)
{
	SetSysFclk(FCLK_400M);  //设置系统时钟 400M     
	ChangeClockDivider(2, 1);      //设置分频 1：4：8
	CalcBusClk();           //计算总线频
	
	Uart_Select(0);
	Uart_Init(0, 115200);
	Uart_Printf("\nBUZZER TEST ( PWM Control )\n");
   	Uart_Printf("Press +/- to increase/reduce the frequency of BUZZER !\n");
	Uart_Printf("Press 'ESC' key to Exit this program !\n\n");
	
	Test_PWM();
}